       IDENTIFICATION DIVISION.
       PROGRAM-ID. 03_DISPLAY.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-INPUT-YOUR-NAME PIC A(6).
       PROCEDURE DIVISION.
           DISPLAY "ENTER YOUR NAME: ".
           ACCEPT WS-INPUT-YOUR-NAME.
           DISPLAY "HELLO " WS-INPUT-YOUR-NAME.
           STOP RUN. 
           